v2206/MSc_icedAirfoil/Meshing_ice_3/+05deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    west
    {
        type            patch;
        nFaces          24;
        startFace       47198;
    }
    east
    {
        type            patch;
        nFaces          24;
        startFace       47222;
    }
    north
    {
        type            patch;
        nFaces          48;
        startFace       47246;
    }
    south
    {
        type            patch;
        nFaces          48;
        startFace       47294;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          23566;
        startFace       47342;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          23566;
        startFace       70908;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          744;
        startFace       94474;
    }
)

// ************************************************************************* //
